var app=angular.module('myApp', []);

function MyCtrl($scope) {
    $scope.currentPage = 0;
    $scope.pageSize = 5;
  $scope.items = [

        {   
            id:"myModal1",
            bookid:"چوڭ گۇناھلار",
            url: 'http://ketablar.weebly.com/uploads/5/0/8/3/5083859/ug_chong_gunahlar.pdf',
title:'چوڭ گۇناھلار ناملىق بۇ ئەسەردە، مۇئەللىپ رەھىمەھۇللاھ قۇرئان ۋە سۈننەتتە بايان قىلىنغان چوڭ گۇناھلارنى دەلىل ئىسپاتلار بىلەن تەپسىلى بايان قىلىپ بېرىدۇ.'
        },
     
       
        {    
            id:"myModal2",
            bookid:"قۇرئان كەرىمدىكى تۆت ئاساسى تېرمىن",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_qoran_kerimdiki_tot_asasi_tirmin.pdf',
            title:'«قۇرئان كەرىمدىكى تۆت ئاساسى تېرمىن» ناملىق بۇ ئەسەردە، قۇرئان كەرىمنىڭ تېرمىنولوگىيىلىك ئاتالغۇلىرى ئىچىدىن مۇسۇلماننىڭ بىلىۋېلىشى ئەڭ مۇھىم بولغان، ئىلاھ، رەب، دىن، ئىبادەتدىن ئىبارەت ئىسلامىي دەۋەتنىڭ ئاساسى بولغان مەزكۇر ئاتالغۇلارغا تەپسىلى چۈشەنچە بېرىدۇ ۋە ئىنسانلارنىڭ بۇ تېرمىنلارنى چۈشۈنىشتىكى بەزى خاتالىقلىرىنى ئوقۇرمەنلەرگە ئۆچۈق يورۇتۇپ بېرىدۇ.'

        }
        ,
        {    
            id:"myModal3",
            bookid:"ئايال ساھابىلار ھاياتىدىن تاللانمىلار",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_ayal_sahabilar_hayatidin_tallanmilar.pdf',
           title:'ئايال ساھابىلار ھاياتىدىن تاللانمىلار» ناملىق بۇ ئەسەر، ئايال ساھابىلاردىن (ئاللاھ ئۇلاردىن رازى بولسۇن) 117 كىشىنىڭ شانلىق تەرجىمىھالىنىڭ قىسقىچى مەزمۇنىنى ئۆز ئىچىگە ئالغان بولۇپ، ئۇلارنىڭ ئۆلگىلىك ئىش-ئىزلىرى، ئىمانى ۋە ئىنسانى ئالاھىدىلىكلىرى، دىننى قوغداش ۋە تارىتىش يولىدا كورسەتكەن پىداكارلىقلىرى، ھىجرەت ۋە جىھاد مەزگىللىرىدىكى ئەزىيەتلەرگە سەبرى قىلىشى...قاتارلىق كۆپلىگەن گۈزەل خىسلەتلەرنى ئوقۇرمەنلەرگە ئەينەن تەسۋىرلەپ بىرىدۇ.'

        }
        ,
        {    
            id:"myModal4",
            bookid:"روزىغا ئالاقىدار ئەھكاملار",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_rozigha_alaqidar_hokumler.pdf',
          title:'روزىغا ئالاقىدار ئەھكاملار ناملىق بۇ رىسالىدە، رامىزان روزىسى ۋە نەپلە روزىلارغا دائىر بولغان بارلىق ئەھكاملار، روزىنىڭ ۋاجىب ۋە شەرتلىرى، سۈننەت ۋە مۇستەھەبلىرى، تەراۋىھ نامىزى، ئېتىكاپ ۋە سەدىقە پىتىر قاتارلىق رامىزان ئېيىدىكى مۇھىم ئەمەللەرنى قۇرئان سۈننەتنىڭ روھىغا ئۇيغۇن ھالدا تەپسىلى بايان قىلىپ بېرىدۇ.'
             }
     ,
        {    
            id:"myModal5",
            bookid:"ئىماننىڭ ئاساسلىرى",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_iymanning_asasliri.pdf',
            title:'ئىماننىڭ ئاساسلىرى، ناملىق بۇ كىتاپ مەشھۇر ئالىم ئەللامە مۇھەممەد سالىھ ئەلئۇسەيمىننىڭ بولۇپ، ياش تەرجىمان دىنى زىيالىي ن. تەمكىنى ئەپەندىم تەرىپىدىن تەرجىمە قىلىندى. بۇ كىتاپ ئىسلام دۇنياسىدا، ئەقىدە توغرىسىدا يېزىلغان ئالدىنقى قاتاردىكى كىتابچە دەپ قارىلىدۇ. بۇ كىتابتا، ئاللاھغا توغرا رەۋىشتە ئىمان كەلتۈرۈش، پەرىشتىلەر، پەيغەمبەرلەر، ساماۋى كىتابلار، ئاخىرەت كۈنى، تەقدىر... قاتارلىق مۇھىم مەسىلىلەرگە قانداق ئىمان كەلتۇرىشىمىز كېرەكلىكىنى قۇرئان ھەدىس ۋە ئەقلى دەلىللەر بىلەن ئىسپاتلاپ بېرىدۇ. '
             }
       ,

        {    
            id:"myModal6",
            bookid:"مۆمىننىڭ ئەقىدىسى",
            url: 'http://ketablar.weebly.com/uploads/5/0/8/3/5083859/ug_mominler_aqidisi.pdf',
title:'«مۆمىننىڭ ئەقىدىسى» ناملىق بۇ ئەسەر، ئىسلام ئەقىدىسى ۋە ئۇنىڭ ئاساسىنى ئۆز ئىچىگە ئالغان بولۇپ، ئەقىدە مەسىلىلىرىنى ئىسپاتلاشتا ئەقلى ۋە شەرئى دەلىللەرنى بىرلىكتە كۆرسىتىپ بېرىش بىلەن بىرگە ھازىرقى زامان تەلىپىگە ئۇيغۇن ھالدا يېزىلغان ئالدىنقى قاتاردىكى ئەقىدە كىتابلىرىدىن سانىلىدۇ.'
             }
  ,

        {    
            id:"myModal7",
            bookid:" ئىسلام دىنىنىڭ روھى (تەۋسىيە ئەسەر)",
            url: 'http://ketablar.weebly.com/uploads/5/0/8/3/5083859/ug_islam_dinining_rohi.pdf',
          title:'«ئىسلام دىنىنىڭ روھى» ناملىق بۇ ئەسەردە ئاپتور ھەرقانداق بىر مۇسۇلماننىڭ بىلىۋېلىشى زۆرۈر بولغان كىشىلىك تۇرمۇش ۋە ئىجتىمائىي جەمئىيەتكە ئائىت ئاساسى مەزمۇننى چۆرىدىگەن ھالدا ئۆزگىچە ئۇسلۇب بىلەن ھەقىقەتنى بايان قىلىپ بېرىدۇ. ئىسلامنىڭ ئاساسى پرىنسىپىنى ئوچۇق يورۇتۇپ بېرىش بىلەن بىرگە، ئىسلام دىنىنىڭ زامان-ماكان تاللىماستىن ھەرقانداق ھازارەت بىلەن خاسلىقىنى ساقلاپ قالغان ھالدا ماسلىشىپ كېتەلەيدىغانلىقى، قۇرئان كەرىمنىڭ ئىلاھىي ۋەھيى، مۇھەممەد ئەلەيھىسسالامنىڭ راستچىل پەيغەمبەر ئىكەنلىكىگە قۇرئان كەرىمدىن ئىلمى دەلىللەرنى كەلتۈرگەندىن سىرت ئەقلى ئىسپاتلار بىلەن دەلىللەيدۇ. دىن دۈشمەنلىرى تەرىپىدىن ئويدۇرۇپ چىقىرىلغان تۆھمەت ۋە شەك-شۇبھىلەرگە ئىلمى ئۇسۇلدا ئەجەللىك زەربە بېرىدۇ.'
             }
             ,

        {    
            id:"myModal8",
            bookid:" ئىسلام دىنىنى ئومۇمى تونۇشتۇرۇش",
            url: 'http://ketablar.weebly.com/uploads/5/0/8/3/5083859/ug_islam_dinini_omumiy_tonushturush.pdf',
title:'«ئىسلام دىنىنى ئومۇمى تونۇشتۇرۇش»ناملىق بۇ ئەسەر ئىسلام دىنىنى ئەڭ ئاسان ئۇسۇل بىلەن چۇشەندۇرۇپلا قالماي؛بەلكى ئىسلامنىڭ ھەقىقى مەنىسىنى مۆمىن قەلبىدە ئۇرغۇتقۇسى.بۇ كىتاب ئۆزگىچە ئۇسلۇبى بىلەن ھەر-خىل شەيتانى خىياللارغا قانائەتلىنەرلىك ئەقلى دەلىل ۋە قۇرئان كەرىم ، ساغلام ھەدىسلەرنىڭ روھى بىلەن ئىلمى ئاساستا ھەقىقەتنى ئوتتۇرىغا قويىدۇ.'
             },
              {    
            id:"myModal9",
            bookid:"پەزىلەتلىك ئەمەل",
            url: 'http://ketablar.weebly.com/uploads/5/0/8/3/5083859/ug_faziletlik_emeller.pdf',
title:'«پەزىلەتلىك ئەمەللەر» ناملىق بۇ كىتاپتا ئاپتۇر ئىسلام دىنىدىكى ئىبادەتلەر ئەقىلغا تايانماستىن ؛بەلكى قۇرئان ۋە ھەدىسگە ئاساسلىنىدىغانلىقىنى بايان قىلىش بىلەن بىرگە، بەندىنى ئاللاھقا يىقىنلاشتۇرىدىغان، ئىنساننىڭ روھى ۋە مەنىۋىيىتىگە ۋاستسىز تەسىر كۆرسىتىدىغان ئەمەللەرنى قۇرئان ۋە ساغلام ھەدىسلەرگە ئاساسلىنىپ تۇرۇپ چۈشەنچە بېىرىدۇ.'
             }
             ,
              {    
            id:"myModal10",
            bookid:"تەنتاۋى جەۋھەرلىرىدىن تاللانمىلار",
            url: 'http://ketablar.weebly.com/uploads/5/0/8/3/5083859/ug_tentawi_jewherliridin_tallanmilar.pdf',
title:'«تەنتاۋى جەۋھەرلىرىدىن تاللانمىلار» ناملىق بۇ كىتاپ تەپسىر جەۋاھىردىن مۇھىم مەزمۇنلارنىڭ تاللانما تەرجىمىسى بولۇپ ،بۇ تەپسىر ھەر-خىل ھازارەت ۋە مەدەنىيەت كۆز قاراشلىرىدىكى جەمىيەتشۇناس ، پىسخىلوگىيە ، بىئولوگىيە ،تەبىئى پەن قاتارلىق بىلىم ئەھلىلىرىنىڭ قۇرئان كەرىمنىڭ ھەقىقىتى بىلەن تونۇشۇپ چېقىشىغا ئاساس سالغۇسى.'
             }
             ,
              {    
            id:"myModal11",
            bookid:"دىنى ئەھكاملاردىن سوئال ۋە جاۋابلار",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_dini_ehkamlardin_soal_jawaplar.pdf',

            title:'«دىنى ئەھكاملاردىن سوئال ۋە جاۋابلار» ناملىق بۇ كىتابچىدا، ئاپتور ئىسلام شەرىئىتىدە چەكلەنگەن ۋە يولغا قويۇلغان مۇھىم مەسىلىلەرنى، كىتابخانلارنىڭ چۈشىنىشىنىڭ قولايلىق بولىشىنى كۆزدە تۇتۇپ، مۇسۇلماننىڭ كۈندىلىك ھاياتىدا بىلىشى زۆرۈر دەپ قارالغان218 سوئال ۋە جاۋابنى، سوئال-جاۋاب شەكلىدە تەييارلاپ ھۆزۈرۈڭلارغا تەقدىم قىلدى.'
             }
 ,
              {    
            id:"myModal12",
            bookid:"مۇناپىقلارنىڭ سۈپەتلىرى",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_munapiklarning_supatliri.pdf',

title:'بۇ كىتاپ ئىمام ئىبنى قەييىم ئەلجەۋزىييە رەھمەتۇللاھى ئەلەيھىنىڭ «مەدارىجۇسسالىكىين»ناملىق ئەسىرىدىن "مۇناپىقلىق" دېگەن بۆلۈمنىڭ تەرجىمىسى بولۇپ، ئاپتور ئەسىرىدە مۇناپىقلىقنىڭ شەخس ۋە جەمئىيەتكە كەلتۈرىدىغان خەتىرى، مۇناپىقلىقنىڭ تۈرلىرى، مۇناپىقنىڭ سۈپەتلىرى، شۇنداقلا ئەقىدىسىگە، مىللىتىگە، ۋەتىنىگە خائىنلىق قىلغان مۇناپىقلار دۇنيادا خار بولسا، ئاخىرەتتە ئاللاھنىڭ دەھشەتلىك ئازابىغا ئۇچرايدىغانلىقى توغرىسىدا قۇرئان ۋە سۈننەت روھى بىلەن تەپسىلى چۇشەنچە بېرىدۇ.'             }

              ,
              {    
            id:"myModal13",
            bookid:"مەشھۇر ئۆلىمالارنى ئەيىبلىمەسلىك توغرىسىدا",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_mashhur_olimalarni_eyiplimaslik_toghrisida.pdf',

title:'«مەشھۇر ئۆلىمالارنى ئەيىبلىمەسلىك توغرىسىدا» ناملىق بۇ ئەسەردە ، ئىسلام ئۈممىتى تەرىپىدىن ئېتىراپ قىلىنغان ئىماملارنىڭ ھېچبىرى قەستەن ھالدا پەيغەمبەر ئەلەيھىسسالامنىڭ مەيلى كىچىك، مەيلى چوڭ بىر سۈننىتىگە قارشى ھەرىكەت قىلمايدىغانلىقى، ئۇلار ھەر تۈرلۈك شۈبھە ۋە ئىككېلىنىشلەردىن يىراق ھالدا پەيغەمبەر ئەلەيھىسسالامغا ئەگىشىشنىڭ ۋاجىبلىقى، پەيغەمبەر ئەلەيھىسسالامدىن باشقا ھەر قانداق كىشىنىڭ سۆزىنىڭ توغرا-خاتاسىنىڭ بولىدىغانلىقى، بۇ ئىماملارنىڭ بىرىنىڭ سەھىھ ھەدىسكە زىت بىر سۆزى بولۇپ قالسا، ئۇنىڭ مەزكۇر ھەدىسنى تەرك قىلىش خۇسۇسىدا جەزمەن قوبۇل قىلغىلى بولىدىغان بىرەر سەۋەبنى دەلىل ئىسپات بىلەن ئوتتۇرىغا قويىدىغانلىقى ۋە شۇ ئارقىلىق باشقىلارنىڭ بۈيۈك ئۆلىمالارغا تىل ئۇزۇتىشىنىڭ ئالدىنى ئالىدىغانلىقى قاتارلىقلار توغرىسىدا چۈشەنچە بىرىدۇ.'
             }
 ,
              {    
            id:"myModal14",
            bookid:"مۇھەممەد ئەلەيھىسسالامنىڭ ھاياتى",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_muhammad_alayhissalamning_terjimehali.pdf',

title:'«مۇھەممەد ئەلەيھىسسالامنىڭ ھاياتى» ناملىق بۇ كىتاب دۇنيا مۇسۇلمانلىرىنىڭ ئالقىشىغا ئېرىشكەن، ياۋرۇپا ئەللىرىدىمۇ كۆرىنەرلىك نەتىجەگە ئېرىشكەن ۋە غەيرى مۇسلىملار ئارىسىدىمۇ غۇلغۇلا قوزغىغان. بۇ كىتابتا مۇھەممەد ئەلەيھىسسالامنىڭ ئائىلە كىلىپ چېقىشى، دۇنياغا كېلىشى ۋە ۋەھيى چۈشۈشتىن ئىلگىرىكى ھاياتى، ئەخلاقى ۋە پەيغەمبەر بولغاندىن كېيىنكى دىن تەشۋىقات پائالىيەتلىرى، ھېجرەت ۋە غازاتلىرى، ۋاپاتى قاتارلىق ئۇ زاتنىڭ ھاياتىغا ئائىت ئىشەنچىلىك مەلۇماتلارنى ھۆزۇرۇڭلارغا سۇنىدۇ.'
             }
,
              {    
            id:"myModal15",
            bookid:"ئىز باسار تۆت خەلىپە",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_izbasar_tot_xalipe.pdf',

title:'«ئىز باسار تۆت خەلىپە » ناملىق بۇ ئەسەر ئەبۇبەكرى سىددىق، ئۆمەر ئىبنى خەتتاب، ئوسمان ئىبنى ئەففان، ئەلى ئىبنى ئەبى تالىب (ئاللاھ ئۇلاردىن رازى بولسۇن) قاتارلىق پەزىلەتلىك تۆت ساھابىنىڭ ھاياتى ۋە ئىش ئىزلىرى بولۇپ، ئۇلارنىڭ خەلىپىلىك دەۋرىدىكى ئىسلامغا قوشقان تۆھپىلىرى، دىن تارقىتىش يولىدا كۆرسەتكەن پىداكارلىق روھلىرى قاتارلىقلارنى جانلىق تەسۋىرلەپ بېرىدۇ.'
             }

    ];
   
}

//We already have a limitTo filter built-in to angular,
//let's make a startFrom filter
app.filter('startFrom', function() {
    return function(input, start) {
        start = +start; //parse to int
        return input.slice(start);
    }
});
